app/controllers/bookmarks_controller.rb

  def index
    if params[:lang]
      @lang = Language.find_by_permalink(params[:lang])
      @bookmarks = Bookmark.paginate :conditions => ["language_id = #{@lang.id}"], :per_page => per_page(60), :page => params[:page]
---
SELECT * FROM `languages` WHERE (`languages`.`permalink` = 'content_length') LIMIT 1
SELECT * FROM `bookmarks` WHERE (language_id = 1) LIMIT 0, 60
SELECT * FROM `languages` ORDER BY name

  def show
    lang = Language.find_by_permalink(params[:lang])
    @bookmark = Bookmark.find_by_permalink(params[:bookmark_name], :conditions => {:language_id => lang.id})
---
SELECT * FROM `languages` WHERE (`languages`.`permalink` = 'ruby-on-rails') LIMIT 1
SELECT * FROM `bookmarks` WHERE (`bookmarks`.`language_id` = 1) AND (`bookmarks`.`permalink` = 'migration-cheat-sheet') LIMIT 1

  def dec_content_length
    session[:bookmark_content_length] -= 1

    #if params[:lang]
      #@lang = Language.find_by_permalink(params[:lang])
      @bookmarks = Bookmark.paginate :conditions => ["language_id = #{@lang.id}"], :per_page => per_page(60), :page => params[:page]
---
SELECT * FROM `bookmarks` LIMIT 0, 60

  def inc_content_length
    session[:bookmark_content_length] += 1

    if params[:lang]
      @lang = Language.find_by_permalink(params[:lang])
      @bookmarks = Bookmark.paginate :conditions => ["language_id = #{@lang.id}"], :per_page => per_page(60), :page => params[:page]
---
SELECT * FROM `bookmarks` LIMIT 0, 60

  def edit
    @bookmark = Bookmark.find(params[:id])
---
SELECT * FROM `bookmarks` WHERE (`bookmarks`.`id` = 1)

  def update
    @bookmark = Bookmark.find(params[:id])

    respond_to do |format|
      if @bookmark.update_attributes(params[:bookmark])
---
SELECT * FROM `bookmarks` WHERE (`bookmarks`.`id` = 2180607000)
UPDATE `bookmarks` SET `updated_at` = '2009-09-21 06:02:19', `description` = 'Test' WHERE `id` = 1